spec/vcr/MercadoPago_CreateAdvancedPayment/using_access_token_in_constructor/behaves_like_run/credit_card_high_risk/returns_success_false.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.mercadopago.com/v1/advanced_payments?access_token=APP_USR-4401258639222046-052215-93e61747e6f50210577e169b695cd277-438050834
    body:
      encoding: UTF-8
      string: ! '{"application_id":"4401258639222046","notification_url":"https://9af20ad2.ngrok.io/inbound","payer":{"email":"test_user_p@testuser.com","first_name":"Amanda","last_name":"Martins","identification":{"type":"CPF","number":"30539945005"}},"payments":[{"payment_type_id":"credit_card","payment_method_id":"master","token":"f22ee10d6586a47a8e9e545c2a806702","transaction_amount":5.0,"installments":1,"processing_mode":"aggregator","description":"Service
        charge","external_reference":"extPayment","statement_descriptor":"WWW.MktSplitterMLBTEST.COM.BR"}],"disbursements":[{"amount":5.0,"external_reference":"ext1","collector_id":438055858,"application_fee":1.0,"additional_info":{"items":[{"id":"item-ID-1234","title":"Item
        Title","description":"Item description","picture_url":"https://some_image.jpg","category_id":"art","quantity":1,"unit_price":5.0}]}}],"binary_mode":true}'
    headers:
      Content-Type:
      - application/json
  response:
    status:
      code: 201
      message: ''
    headers:
      Date:
      - Wed, 26 Jun 2019 17:06:38 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1940'
      Connection:
      - keep-alive
      Vary:
      - Accept-Encoding
      X-Request-Id:
      - 3add28a5-2e1b-4c42-98e8-5d4675103789
      X-Content-Type-Options:
      - nosniff
      X-Xss-Protection:
      - 1; mode=block
      Strict-Transport-Security:
      - max-age=16070400; includeSubDomains; preload
      Access-Control-Allow-Origin:
      - ! '*'
      Access-Control-Allow-Headers:
      - Content-Type
      Access-Control-Allow-Methods:
      - PUT, GET, POST, DELETE, OPTIONS
      Access-Control-Max-Age:
      - '86400'
    body:
      encoding: US-ASCII
      string: ! '{"id":61834578,"status":"rejected","marketplace":"MP-MKT-4401258639222046","sponsor_id":null,"payments":[{"id":4904316225,"status":"rejected","status_detail":"cc_rejected_high_risk","payment_type_id":"credit_card","payment_method_id":"master","token":"f22ee10d6586a47a8e9e545c2a806702","transaction_amount":5.0,"installments":1,"processing_mode":"aggregator","issuer_id":null,"coupon_amount":null,"campaign_id":null,"coupon_code":null,"description":"Service
        charge","external_reference":"extPayment","differential_pricing_id":null,"statement_descriptor":"WWW.MktSplitterMLBTEST.COM.BR","date_of_expiration":null,"merchant_account_id":null,"payment_method_option_id":null,"acquirer":null,"merchant_number":null,"additional_info":null,"transaction_details":{"external_resource_url":null,"total_paid_amount":5,"financial_institution":null},"net_amount":null,"taxes":null}],"disbursements":[{"id":null,"amount":5.0,"external_reference":"ext1","collector_id":438055858,"application_fee":1.0,"money_release_days":30,"additional_info":{"ip_address":null,"shipments":null,"payer":null,"items":[{"id":"item-ID-1234","title":"Item
        Title","description":"Item description","picture_url":"https://some_image.jpg","category_id":"art","quantity":1,"unit_price":5.0}]}}],"payer":{"id":null,"email":"test_user_p@testuser.com","address":null,"type":null,"identification":{"type":"CPF","number":"30539945005"},"first_name":"Amanda","last_name":"Martins","phone":null,"registration_date":null,"entity_type":null},"order":null,"external_reference":null,"description":null,"binary_mode":true,"capture":true,"notification_url":"https://9af20ad2.ngrok.io/inbound","callback_url":null,"date_created":"2019-06-26T13:06:35.598-04:00","date_last_updated":"2019-06-26T13:06:38.054-04:00","metadata":null,"additional_info":null,"application_id":4401258639222046,"client_id":4401258639222046,"currency_id":"BRL","site_id":"MLB","owner_id":438050834,"wallet_payment":null}'
    http_version: 
  recorded_at: Wed, 26 Jun 2019 17:06:38 GMT
recorded_with: VCR 5.0.0